In [ ]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/MiniProjectDatasets/penguins/penguins_cleaned.csv")

In [ ]:
df.head(5)

  species     island  bill_length_mm  ...  flipper_length_mm  body_mass_g     sex
0  Adelie  Torgersen            39.1  ...                181         3750    male
1  Adelie  Torgersen            39.5  ...                186         3800  female
2  Adelie  Torgersen            40.3  ...                195         3250  female
3  Adelie  Torgersen            36.7  ...                193         3450  female
4  Adelie  Torgersen            39.3  ...                190         3650    male

[5 rows x 7 columns]

In [ ]:
df.shape

(333, 7)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 333 entries, 0 to 332
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            333 non-null    object
 1   island             333 non-null    object
 2   bill_length_mm     333 non-null    float64
 3   bill_depth_mm      333 non-null    float64
 4   flipper_length_mm  333 non-null    int64
 5   body_mass_g        333 non-null    int64
 6   sex                333 non-null    object
dtypes: float64(2), int64(2), object(3)
memory usage: 18.3+ KB

In [ ]:
df.isnull().mean()

species              0.0
island               0.0
bill_length_mm       0.0
bill_depth_mm        0.0
flipper_length_mm    0.0
body_mass_g          0.0
sex                  0.0
dtype: float64

In [ ]:
df.head()

  species     island  bill_length_mm  ...  flipper_length_mm  body_mass_g     sex
0  Adelie  Torgersen            39.1  ...                181         3750    male
1  Adelie  Torgersen            39.5  ...                186         3800  female
2  Adelie  Torgersen            40.3  ...                195         3250  female
3  Adelie  Torgersen            36.7  ...                193         3450  female
4  Adelie  Torgersen            39.3  ...                190         3650    male

[5 rows x 7 columns]

In [ ]:
target="species"
encode=['sex','island']

In [ ]:
for col in encode:
  dummy=pd.get_dummies(df[col],prefix=col)
  df=pd.concat([df,dummy],axis=1)

In [ ]:
df.head(5)

  species     island  ...  island_Dream  island_Torgersen
0  Adelie  Torgersen  ...             0                 1
1  Adelie  Torgersen  ...             0                 1
2  Adelie  Torgersen  ...             0                 1
3  Adelie  Torgersen  ...             0                 1
4  Adelie  Torgersen  ...             0                 1

[5 rows x 12 columns]

In [ ]:
df.drop(columns='sex',axis=1,inplace=True)

In [ ]:
df.drop(columns='island',axis=1,inplace=True)

In [ ]:
df.head()

  species  bill_length_mm  ...  island_Dream  island_Torgersen
0  Adelie            39.1  ...             0                 1
1  Adelie            39.5  ...             0                 1
2  Adelie            40.3  ...             0                 1
3  Adelie            36.7  ...             0                 1
4  Adelie            39.3  ...             0                 1

[5 rows x 10 columns]

In [ ]:
df["species"].value_counts()

Adelie       146
Gentoo       119
Chinstrap     68
Name: species, dtype: int64

In [ ]:
target_mapper={"Adelie":0,"Gentoo":1,"Chinstrap":2}

In [ ]:
def target_encode(val):
  return target_mapper[val]

In [ ]:
target_encode("Adelie")

0

In [ ]:
df["species"]=df["species"].apply(target_encode)

In [ ]:
df["species"]

0      0
1      0
2      0
3      0
4      0
      ..
328    2
329    2
330    2
331    2
332    2
Name: species, Length: 333, dtype: int64

In [ ]:
df.head()

   species  bill_length_mm  ...  island_Dream  island_Torgersen
0        0            39.1  ...             0                 1
1        0            39.5  ...             0                 1
2        0            40.3  ...             0                 1
3        0            36.7  ...             0                 1
4        0            39.3  ...             0                 1

[5 rows x 10 columns]

In [ ]:
X=df.drop("species",axis=1)
Y=df["species"]

In [ ]:
from sklearn.ensemble import RandomForestClassifier

In [ ]:
clf=RandomForestClassifier()

In [ ]:
y_pred=clf.fit(X,Y)

In [ ]:
clf.score(X,Y)

1.0

In [ ]:
import pickle
pickle.dump(clf, open('penguins_clf.pkl', 'wb'))